Enums/СпособыРасчетаАванса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаАванса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированнойСуммой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомОтТарифа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетомЗаПервуюПоловинуМесяца</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОграниченияПособия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОграниченияПособия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщееОграничение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеВРазмереММОТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОграничений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерЕжемесячнойСтраховойВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеВРазмереДвухММОТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РасчетЗарплатыБазовыйКлиентСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обслуживание полей аванса

Функция РазмерностьАванса(СпособРасчетаАванса) Экспорт
	
	РазмерностьАванса = Неопределено;
	Если СпособРасчетаАванса = ПредопределенноеЗначение("Перечисление.СпособыРасчетаАванса.ПроцентомОтТарифа") Тогда
		РазмерностьАванса = "%"
	ИначеЕсли СпособРасчетаАванса = ПредопределенноеЗначение("Перечисление.СпособыРасчетаАванса.ФиксированнойСуммой") Тогда
		РазмерностьАванса = НСтр("ru='грн.';uk='грн.'")
	КонецЕсли;
	
	Возврат РазмерностьАванса
	
КонецФункции	

Функция ПредставлениеСпособаРасчетаАванса(СпособРасчетаАванса, СжатыйФормат) Экспорт 
	
	СтрокаПодстановки = "";
	
	Если СпособРасчетаАванса = ПредопределенноеЗначение("Перечисление.СпособыРасчетаАванса.ПроцентомОтТарифа") Тогда
		СтрокаПодстановки = ?(СжатыйФормат, НСтр("ru='%2%3';uk='%2%3'"), НСтр("ru='Ранее получал аванс %2%3 от тарифа';uk='Раніше отримував аванс %2%3 від тарифу'"));
	Иначе
		СтрокаПодстановки = ?(СжатыйФормат, НСтр("ru='%2 %3';uk='%2 %3'"), НСтр("ru='Ранее получал аванс %2 %3';uk='Раніше отримував аванс %2 %3'"));
	КонецЕсли;
			
	Возврат СтрокаПодстановки;
		
КонецФункции	

Функция ИменаСпособовРасчетаАванса() Экспорт
	
	ИменаСпособовРасчета = Новый Массив;
	ИменаСпособовРасчета.Добавить("ФиксированнойСуммой");
	ИменаСпособовРасчета.Добавить("ПроцентомОтТарифа");

	Возврат ИменаСпособовРасчета;
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбораВидовОграниченияПособия(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	Если НЕ Параметры.Отбор.Свойство("Ссылка") Тогда
		
		МассивДоступныхСсылок = Новый Массив;
		МассивДоступныхСсылок.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОграниченияПособия.ОбщееОграничение"));
		МассивДоступныхСсылок.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОграниченияПособия.ОграничениеВРазмереММОТ"));
		МассивДоступныхСсылок.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОграниченияПособия.МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"));
		
		Параметры.Отбор.Вставить("Ссылка", МассивДоступныхСсылок);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
